embedded-template/gd32h759-freertos11/app/main.c
#include "gd32h7xx.h"
#include <stdio.h>

/* FreeRTOS includes */
#include "FreeRTOS.h"
#include "task.h"

void cache_enable(void);
void mpu_config(void);

/* FreeRTOS task functions */
void vTask1_LED_Toggle(void *pvParameters);
void vTask2_Print_Counter(void *pvParameters);

/* Task handles */
TaskHandle_t xTask1Handle = NULL;
TaskHandle_t xTask2Handle = NULL;


/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    /* enable the CPU cache */
    cache_enable();
    mpu_config();
    

    xTaskCreate(vTask1_LED_Toggle,           /* Task function */
                         "LED_Task",                   /* Task name */
                         configMINIMAL_STACK_SIZE,     /* Stack size */
                         NULL,                         /* Parameters */
                         3,                            /* Priority */
                         &xTask1Handle);               /* Task handle */
    
    xTaskCreate(vTask2_Print_Counter,        /* Task function */
                         "Print_Task",                 /* Task name */
                         configMINIMAL_STACK_SIZE,     /* Stack size */
                         NULL,                         /* Parameters */
                         4,                            /* Priority (lower than Task1) */
                         &xTask2Handle);               /* Task handle */
	
	vTaskStartScheduler();
    while(1);
}


/*!
    \brief      enable the CPU cache
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cache_enable(void)
{
    /* enable i-cache */
    SCB_EnableICache();
    /* enable d-cache */
    SCB_EnableDCache();
}

/*!
    \brief      configure the MPU attributes
    \param[in]  none
    \param[out] none
    \retval     none
*/
void mpu_config(void)
{
    mpu_region_init_struct mpu_init_struct;
    mpu_region_struct_para_init(&mpu_init_struct);

    /* disable the MPU */
    ARM_MPU_Disable();
    ARM_MPU_SetRegion(0, 0);

    /* configure the MPU attributes for the entire 4GB area, Reserved, no access */
    /* This configuration is highly recommended to prevent Speculative Prefetching of external memory, 
       which may cause CPU read locks and even system errors */
    mpu_init_struct.region_base_address  = 0x0;
    mpu_init_struct.region_size          = MPU_REGION_SIZE_4GB;
    mpu_init_struct.access_permission    = MPU_AP_NO_ACCESS;
    mpu_init_struct.access_bufferable    = MPU_ACCESS_NON_BUFFERABLE;
    mpu_init_struct.access_cacheable     = MPU_ACCESS_NON_CACHEABLE;
    mpu_init_struct.access_shareable     = MPU_ACCESS_SHAREABLE;
    mpu_init_struct.region_number        = MPU_REGION_NUMBER0;
    mpu_init_struct.subregion_disable    = 0x87;
    mpu_init_struct.instruction_exec     = MPU_INSTRUCTION_EXEC_NOT_PERMIT;
    mpu_init_struct.tex_type             = MPU_TEX_TYPE0;
    mpu_region_config(&mpu_init_struct);
    mpu_region_enable();

    /* enable the MPU */
    ARM_MPU_Enable(MPU_MODE_PRIV_DEFAULT);
}

/*!
    \brief      FreeRTOS Task 1: LED Toggle Task
    \param[in]  pvParameters: task parameters
    \param[out] none
    \retval     none
*/
void vTask1_LED_Toggle(void *pvParameters)
{
	static uint32_t led_counter = 0; 
    for(;;)
    {
        /* Toggle LED simulation - in real hardware, you would toggle actual LED */
        led_counter++;
        
        /* Wait for the next cycle (500ms) */
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

/*!
    \brief      FreeRTOS Task 2: Print Counter Task  
    \param[in]  pvParameters: task parameters
    \param[out] none
    \retval     none
*/
void vTask2_Print_Counter(void *pvParameters)
{
    static uint32_t print_counter = 0;


    
    for(;;)
    {
        /* Print counter */
        print_counter++;
    
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

#if 0
#ifdef GD_ECLIPSE_GCC
/* retarget the C library printf function to the USART, in Eclipse GCC environment */
int __io_putchar(int ch)
{
    usart_data_transmit(EVAL_COM, (uint8_t) ch );
    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TBE));
    return ch;
}
#else
/* retarget the C library printf function to the USART */
int fputc(int ch, FILE *f)
{
    usart_data_transmit(EVAL_COM, (uint8_t)ch);
    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TBE));

    return ch;
}
#endif /* GD_ECLIPSE_GCC */
#endif

#if(configCHECK_FOR_STACK_OVERFLOW)
void vApplicationStackOverflowHook(TaskHandle_t xTask, char* pcTaskName)
{
    for (;;) {}
}
#endif

